tap "homebrew/bundle"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "shivammathur/extensions"
tap "shivammathur/php"
brew "act"
brew "openssl@3"
brew "autoconf"
brew "python@3.12"
brew "awscli"
brew "bash"
brew "bat"
brew "python-setuptools"
brew "icu4c@76"
brew "php"
brew "composer"
brew "coreutils"
brew "dockutil"
brew "eza"
brew "tesseract"
brew "ffmpeg"
brew "gh"
brew "gifsicle"
brew "git"
brew "grep"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jpegoptim"
brew "jq"
brew "mackup"
brew "mas"
brew "mysql", restart_service: :changed
brew "node"
brew "optipng"
brew "pkgconf"
brew "pngquant"
brew "pure"
brew "starship"
brew "subversion"
brew "svgo"
brew "watchman"
brew "webkit2png"
brew "wget"
brew "yarn"
brew "yt-dlp"
brew "zsh"
brew "shivammathur/extensions/pcov@8.3"
brew "shivammathur/extensions/pcov@8.4"
cask "4k-video-downloader+"
cask "appcleaner"
cask "chatgpt"
cask "discord"
cask "figma"
cask "font-jetbrains-mono"
cask "github"
cask "google-chrome"
cask "handbrake"
cask "herd"
cask "hyper"
cask "imageoptim"
cask "jetbrains-toolbox"
cask "macupdater"
cask "mediainfo"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "mysqlworkbench"
cask "ngrok"
cask "postman"
cask "qbittorrent"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "raycast"
cask "runjs"
cask "ssh-config-editor"
cask "subler"
cask "tinkerwell"
cask "vlc"
mas "Developer", id: 640199958
mas "DevUtils", id: 1533756032
mas "Infuse", id: 1136220934
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "OneDrive", id: 823766827
mas "Swift Playground", id: 1496833156
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
