tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/services"
brew "openssl@3"
brew "autoconf"
brew "python@3.12"
brew "awscli"
brew "bash"
brew "bat"
brew "composer"
brew "coreutils"
brew "dockutil"
brew "eza"
brew "tesseract"
brew "ffmpeg"
brew "gh"
brew "gifsicle"
brew "git"
brew "grep"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jpegoptim"
brew "jq"
brew "mackup"
brew "mas"
brew "mysql", restart_service: true
brew "node"
brew "optipng"
brew "pkg-config"
brew "pngquant"
brew "pure"
brew "python-setuptools"
brew "starship"
brew "subversion"
brew "svgo"
brew "webkit2png"
brew "wget"
brew "yarn"
brew "zsh"
cask "4k-video-downloader+"
cask "appcleaner"
cask "batteries"
cask "chatgpt"
cask "codeedit"
cask "discord"
cask "font-jetbrains-mono"
cask "github"
cask "google-chrome"
cask "herd"
cask "hyper"
cask "imageoptim"
cask "jetbrains-toolbox"
cask "mediainfo"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "postman"
cask "qbittorrent"
cask "qlmarkdown"
cask "quicklook-json"
cask "raycast"
cask "ssh-config-editor"
cask "subler"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
mas "Developer", id: 640199958
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Playgrounds", id: 1496833156
mas "Sequel Ace", id: 1518036000
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
vscode "aryeh.copy-without-indent"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "cjhowe7.laravel-blade"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "jundat95.react-native-snippet"
vscode "kotfire.php-add-property"
vscode "mansoorkhan96.php-cs-fixer"
vscode "mehedidracula.php-constructor"
vscode "mehedidracula.php-namespace-resolver"
vscode "mrchetan.phpstorm-parameter-hints-in-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "neilbrayfield.php-docblocker"
vscode "onecentlin.php-productive-pack"
vscode "onecentlin.phpunit-snippets"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "recca0120.vscode-phpunit"
vscode "redhat.vscode-yaml"
vscode "unifiedjs.vscode-mdx"
vscode "unional.vscode-sort-package-json"
vscode "wayou.vscode-todo-highlight"
vscode "william-voyek.vscode-nginx"
vscode "xabikos.javascriptsnippets"
vscode "xdebug.php-debug"
vscode "zhuangtongfa.material-theme"
