tap "codeclimate/formulae"
tap "eth-p/software"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "shivammathur/php"
# Automatic configure script builder
brew "autoconf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line interface for SQLite
brew "sqlite"
# Dependency Manager for PHP
brew "composer"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: true
# Standard SGML representation system for technical documents
brew "docbook"
# GNU multiple precision arithmetic library
brew "gmp"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git", link: false
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg@1.4"
# Kubernetes package manager
brew "helm"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Mac App Store command-line interface
brew "mas"
# Replacement for the old crypt package and crypt(1) command
brew "mcrypt"
# Run a Kubernetes cluster locally
brew "minikube"
# Open source relational database management system
brew "mysql", restart_service: true
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx", restart_service: true
# Platform built on V8 to build network applications
brew "node"
# General-purpose scripting language
brew "php", link: false
# General-purpose scripting language
brew "php@7.4", restart_service: true, link: true
# Persistent key-value database, with built-in net interface
brew "redis"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# User interface to the TELNET protocol
brew "telnet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Text editor
cask "atom"
# Two-factor authentication software
cask "authy"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
cask "font-inconsolata"
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Track and update to the latest versions of installed software
cask "macupdater"
# App to write, plan, collaborate, and get organized
cask "notion"
cask "phpstorm"
# Collaboration platform for API development
cask "postman"
cask "wkhtmltopdf"
mas "iMovie", id: 408981434
mas "Magnet", id: 441258766
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Xcode", id: 497799835
